IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_sd_storage.c
#include "camera_sd_storage.h"

#include "bsp_log.h"
#include "camera_snapshot_control.h"
#include "stm32f4xx_hal.h"

#include <stddef.h>
#include <string.h>

/*
 * Stage 11C-1 在既有冲突引脚切换成功后，将 PC8～PC12 和 PD2 配置为 SDIO AF12，
 * 并在 EXIT 时先将六个引脚退回 GPIO 输入态，再恢复 PC8、PC9、PC11 的 DCMI AF13。
 * PC8、PC9、PC11 同时被 DCMI 和 SDIO 使用，后续必须先停止 DCMI 和相关 DMA，
 * 再进入 SDIO 接管流程。Stage 11C-4 在 HAL_SD_Init 成功后读取 HAL 层卡信息，
 * 不接入 FATFS，不执行块读写，也不启用 SDIO 中断或 DMA。
 */
static CameraSdStorageStatus_t s_camera_sd_status;
static SD_HandleTypeDef hsd_snapshot;
static uint32_t s_atk_official_path_active;
static uint32_t s_atk_official_hal_initialized;
static uint32_t s_atk_1bit_path_active;
static uint32_t s_atk_1bit_hal_initialized;
/* 使用 uint32_t 数组保证 4 字节对齐，仅用于 HAL SD polling 只读块验证，不写卡。 */
static uint32_t s_sd_read_test_words[128];
static uint32_t s_atk_1bit_read_buffer_words[128];

#define CAMERA_SD_READ_BUFFER_LEN 512U
#define CAMERA_SD_READ_PREFILL_PATTERN 0xA5U
#define CAMERA_SD_READ_NO_CHANGED_INDEX 0xFFFFFFFFU
#define CAMERA_SD_ATK_WAIT_TRANSFER_TIMEOUT_MS 1000U
#define CAMERA_SD_ATK_1BIT_READ_TIMEOUT_MS 1000U
#define CAMERA_SD_ATK_1BIT_WAIT_POLL_LIMIT 100000U

/* C5G 只读保存 HAL_SD_ReadBlocks 前后的 SDIO 寄存器，不清除任何状态标志。 */
typedef struct
{
    uint32_t sta;
    uint32_t clkcr;
    uint32_t dctrl;
    uint32_t dlen;
    uint32_t dcount;
    uint32_t fifocnt;
    uint32_t power;
    uint32_t arg;
    uint32_t cmd;
    uint32_t resp_cmd;
    uint32_t resp1;
    uint32_t resp2;
    uint32_t resp3;
    uint32_t resp4;
} Camera_SDSdioRegSnapshot_t;

typedef struct
{
    Camera_SDSdioRegSnapshot_t before_wait;
    Camera_SDSdioRegSnapshot_t before_read;
    Camera_SDSdioRegSnapshot_t after_read;
    uint32_t last_hal_state_before_read;
    uint32_t last_hal_state_after_read;
    uint32_t last_hal_error_after_read;
    uint32_t last_block_read_buffer_inspected;
    uint32_t last_block_read_buffer_len;
    uint32_t last_block_read_prefill_pattern;
    uint32_t last_block_read_buffer_sum512;
    uint32_t last_block_read_buffer_xor512;
    uint32_t last_block_read_buffer_nonzero_count512;
    uint32_t last_block_read_buffer_zero_count512;
    uint32_t last_block_read_buffer_ff_count512;
    uint32_t last_block_read_buffer_prefill_count512;
    uint32_t last_block_read_buffer_changed_count512;
    uint32_t last_block_read_buffer_changed;
    uint32_t last_block_read_buffer_all_prefill;
    uint32_t last_block_read_buffer_all_zero;
    uint32_t last_block_read_buffer_all_ff;
    uint32_t last_block_read_buffer_first_changed_index;
    uint32_t last_block_read_buffer_last_changed_index;
    uint8_t last_block_read_buffer_first16[16];
    uint8_t last_block_read_buffer_first32[32];
    uint8_t last_block_read_buffer_tail16[16];
} Camera_SDReadRegDiag_t;

static Camera_SDReadRegDiag_t s_read_reg_diag;

/* C5D-2 独立调试状态：不进入 CameraSdStorageStatus_t，也不参与 INIT/EXIT。 */
typedef struct
{
    uint32_t supported;
    uint32_t requested_width;
    uint32_t active_width;
    uint32_t attempt_count;
    uint32_t success_count;
    uint32_t error_count;
    uint32_t last_result;
    uint32_t last_hal_status;
    uint32_t last_hal_error;
    uint32_t last_pre_card_state;
    uint32_t last_post_card_state;
    uint32_t last_wait_card_state;
    uint32_t last_operation_ms;
    uint32_t last_wait_operation_ms;
    uint32_t last_wait_timeout_ms;
} Camera_SDBusWidthDebug_t;

static Camera_SDBusWidthDebug_t s_bus_width_debug = {1U};

static void Camera_SDStorage_CaptureSdioRegSnapshot(
    Camera_SDSdioRegSnapshot_t *snapshot)
{
    if (snapshot == NULL)
    {
        return;
    }

    snapshot->sta = SDIO->STA;
    snapshot->clkcr = SDIO->CLKCR;
    snapshot->dctrl = SDIO->DCTRL;
    snapshot->dlen = SDIO->DLEN;
    snapshot->dcount = SDIO->DCOUNT;
    snapshot->fifocnt = SDIO->FIFOCNT;
    snapshot->power = SDIO->POWER;
    snapshot->arg = SDIO->ARG;
    snapshot->cmd = SDIO->CMD;
    snapshot->resp_cmd = SDIO->RESPCMD;
    snapshot->resp1 = SDIO->RESP1;
    snapshot->resp2 = SDIO->RESP2;
    snapshot->resp3 = SDIO->RESP3;
    snapshot->resp4 = SDIO->RESP4;
}

static uint32_t Camera_SDStorage_IsStaFlagSet(
    uint32_t sta,
    uint32_t flag)
{
    return ((sta & flag) != 0U) ? 1U : 0U;
}

static void Camera_SDStorage_AnalyzeReadBuffer(
    const uint8_t *buffer,
    uint32_t length)
{
    uint32_t index;
    uint32_t sum = 0U;
    uint32_t xor_value = 0U;
    uint32_t nonzero_count = 0U;
    uint32_t zero_count = 0U;
    uint32_t ff_count = 0U;
    uint32_t prefill_count = 0U;
    uint32_t changed_count = 0U;
    uint32_t first_changed_index = CAMERA_SD_READ_NO_CHANGED_INDEX;
    uint32_t last_changed_index = CAMERA_SD_READ_NO_CHANGED_INDEX;

    if ((buffer == NULL) || (length != CAMERA_SD_READ_BUFFER_LEN))
    {
        s_read_reg_diag.last_block_read_buffer_inspected = 0U;
        s_read_reg_diag.last_block_read_buffer_len = 0U;
        return;
    }

    for (index = 0U; index < length; ++index)
    {
        uint32_t value = buffer[index];

        sum += value;
        xor_value ^= value;
        if (value != 0U)
        {
            ++nonzero_count;
        }
        else
        {
            ++zero_count;
        }

        if (value == 0xFFU)
        {
            ++ff_count;
        }

        if (value == CAMERA_SD_READ_PREFILL_PATTERN)
        {
            ++prefill_count;
        }
        else
        {
            if (changed_count == 0U)
            {
                first_changed_index = index;
            }
            last_changed_index = index;
            ++changed_count;
        }
    }

    s_read_reg_diag.last_block_read_buffer_inspected = 1U;
    s_read_reg_diag.last_block_read_buffer_len = length;
    s_read_reg_diag.last_block_read_prefill_pattern =
        CAMERA_SD_READ_PREFILL_PATTERN;
    s_read_reg_diag.last_block_read_buffer_sum512 = sum;
    s_read_reg_diag.last_block_read_buffer_xor512 = xor_value;
    s_read_reg_diag.last_block_read_buffer_nonzero_count512 = nonzero_count;
    s_read_reg_diag.last_block_read_buffer_zero_count512 = zero_count;
    s_read_reg_diag.last_block_read_buffer_ff_count512 = ff_count;
    s_read_reg_diag.last_block_read_buffer_prefill_count512 = prefill_count;
    s_read_reg_diag.last_block_read_buffer_changed_count512 = changed_count;
    s_read_reg_diag.last_block_read_buffer_changed =
        (changed_count > 0U) ? 1U : 0U;
    s_read_reg_diag.last_block_read_buffer_all_prefill =
        (prefill_count == length) ? 1U : 0U;
    s_read_reg_diag.last_block_read_buffer_all_zero =
        (zero_count == length) ? 1U : 0U;
    s_read_reg_diag.last_block_read_buffer_all_ff =
        (ff_count == length) ? 1U : 0U;
    s_read_reg_diag.last_block_read_buffer_first_changed_index =
        first_changed_index;
    s_read_reg_diag.last_block_read_buffer_last_changed_index =
        last_changed_index;
    memcpy(
        s_read_reg_diag.last_block_read_buffer_first16,
        buffer,
        sizeof(s_read_reg_diag.last_block_read_buffer_first16));
    memcpy(
        s_read_reg_diag.last_block_read_buffer_first32,
        buffer,
        sizeof(s_read_reg_diag.last_block_read_buffer_first32));
    memcpy(
        s_read_reg_diag.last_block_read_buffer_tail16,
        &buffer[length -
                sizeof(s_read_reg_diag.last_block_read_buffer_tail16)],
        sizeof(s_read_reg_diag.last_block_read_buffer_tail16));
}

#define CAMERA_SD_CONFLICT_PIN_MASK \
    (GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_11)
#define CAMERA_SD_CONFLICT_MODE_MASK \
    ((3UL << (8U * 2U)) | (3UL << (9U * 2U)) | (3UL << (11U * 2U)))
#define CAMERA_SD_CONFLICT_AF_MODE \
    ((2UL << (8U * 2U)) | (2UL << (9U * 2U)) | (2UL << (11U * 2U)))
#define CAMERA_SD_CONFLICT_SPEED_VERY_HIGH \
    CAMERA_SD_CONFLICT_MODE_MASK
#define CAMERA_SD_CONFLICT_PULLUP \
    ((1UL << (8U * 2U)) | (1UL << (9U * 2U)) | (1UL << (11U * 2U)))
#define CAMERA_SD_CONFLICT_AFRH_MASK \
    ((0xFUL << 0U) | (0xFUL << 4U) | (0xFUL << 12U))
#define CAMERA_SD_CONFLICT_AFRH_AF12 \
    ((12UL << 0U) | (12UL << 4U) | (12UL << 12U))
#define CAMERA_SD_CONFLICT_AFRH_AF13 \
    ((13UL << 0U) | (13UL << 4U) | (13UL << 12U))

#define CAMERA_SD_FULL_GPIOC_PIN_MASK \
    (GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12)
#define CAMERA_SD_FULL_GPIOC_MODE_MASK \
    ((3UL << (8U * 2U)) | (3UL << (9U * 2U)) | \
     (3UL << (10U * 2U)) | (3UL << (11U * 2U)) | \
     (3UL << (12U * 2U)))
#define CAMERA_SD_FULL_GPIOC_AF_MODE \
    ((2UL << (8U * 2U)) | (2UL << (9U * 2U)) | \
     (2UL << (10U * 2U)) | (2UL << (11U * 2U)) | \
     (2UL << (12U * 2U)))
#define CAMERA_SD_FULL_GPIOC_PULLUP \
    ((1UL << (8U * 2U)) | (1UL << (9U * 2U)) | \
     (1UL << (10U * 2U)) | (1UL << (11U * 2U)) | \
     (1UL << (12U * 2U)))
#define CAMERA_SD_FULL_GPIOC_AFRH_MASK \
    ((0xFUL << 0U) | (0xFUL << 4U) | (0xFUL << 8U) | \
     (0xFUL << 12U) | (0xFUL << 16U))
#define CAMERA_SD_FULL_GPIOC_AFRH_AF12 \
    ((12UL << 0U) | (12UL << 4U) | (12UL << 8U) | \
     (12UL << 12U) | (12UL << 16U))

#define CAMERA_SD_FULL_GPIOD_PIN_MASK GPIO_PIN_2
#define CAMERA_SD_FULL_GPIOD_MODE_MASK (3UL << (2U * 2U))
#define CAMERA_SD_FULL_GPIOD_AF_MODE (2UL << (2U * 2U))
#define CAMERA_SD_FULL_GPIOD_PULLUP (1UL << (2U * 2U))
#define CAMERA_SD_FULL_GPIOD_AFRL_MASK (0xFUL << 8U)
#define CAMERA_SD_FULL_GPIOD_AFRL_AF12 (12UL << 8U)

typedef struct
{
    GPIO_TypeDef *port;
    uint32_t pin_number;
    const char *name;
} Camera_SDLineDef_t;

static const Camera_SDLineDef_t s_camera_sd_lines[] =
{
    {GPIOC, 8U, "pc8_d0"},
    {GPIOC, 9U, "pc9_d1"},
    {GPIOC, 10U, "pc10_d2"},
    {GPIOC, 11U, "pc11_d3"},
    {GPIOC, 12U, "pc12_ck"},
    {GPIOD, 2U, "pd2_cmd"}
};

