IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_sd_storage.c
static uint32_t Camera_SDStorage_GetPinMode(
    GPIO_TypeDef *port,
    uint32_t pin_number)
{
    return (port->MODER >> (pin_number * 2U)) & 0x3U;
}

static uint32_t Camera_SDStorage_GetPinPull(
    GPIO_TypeDef *port,
    uint32_t pin_number)
{
    return (port->PUPDR >> (pin_number * 2U)) & 0x3U;
}

static uint32_t Camera_SDStorage_GetPinSpeed(
    GPIO_TypeDef *port,
    uint32_t pin_number)
{
    return (port->OSPEEDR >> (pin_number * 2U)) & 0x3U;
}

static uint32_t Camera_SDStorage_GetPinAf(
    GPIO_TypeDef *port,
    uint32_t pin_number)
{
    if (pin_number < 8U)
    {
        return (port->AFR[0] >> (pin_number * 4U)) & 0xFU;
    }

    return (port->AFR[1] >> ((pin_number - 8U) * 4U)) & 0xFU;
}

static uint32_t Camera_SDStorage_GetPinIdr(
    GPIO_TypeDef *port,
    uint32_t pin_number)
{
    return (port->IDR >> pin_number) & 0x1U;
}

static void Camera_SDStorage_AnalyzeAtk1BitReadBuffer(
    const uint8_t *buffer,
    uint32_t length)
{
    uint32_t index;
    uint32_t sum = 0U;
    uint32_t xor_value = 0U;
    uint32_t nonzero_count = 0U;
    uint32_t zero_count = 0U;
    uint32_t ff_count = 0U;
    uint32_t prefill_count = 0U;
    uint32_t changed_count = 0U;
    uint32_t first_changed_index = CAMERA_SD_READ_NO_CHANGED_INDEX;
    uint32_t last_changed_index = CAMERA_SD_READ_NO_CHANGED_INDEX;

    if ((buffer == NULL) || (length != CAMERA_SD_READ_BUFFER_LEN))
    {
        s_camera_sd_status.atk_1bit_buffer_inspected = 0U;
        s_camera_sd_status.atk_1bit_buffer_len = 0U;
        return;
    }

    for (index = 0U; index < length; ++index)
    {
        uint32_t value = buffer[index];

        sum += value;
        xor_value ^= value;
        if (value != 0U)
        {
            ++nonzero_count;
        }
        else
        {
            ++zero_count;
        }

        if (value == 0xFFU)
        {
            ++ff_count;
        }

        if (value == CAMERA_SD_READ_PREFILL_PATTERN)
        {
            ++prefill_count;
        }
        else
        {
            if (changed_count == 0U)
            {
                first_changed_index = index;
            }
            last_changed_index = index;
            ++changed_count;
        }
    }

    s_camera_sd_status.atk_1bit_buffer_inspected = 1U;
    s_camera_sd_status.atk_1bit_buffer_len = length;
    s_camera_sd_status.atk_1bit_prefill_pattern =
        CAMERA_SD_READ_PREFILL_PATTERN;
    s_camera_sd_status.atk_1bit_buffer_sum512 = sum;
    s_camera_sd_status.atk_1bit_buffer_xor512 = xor_value;
    s_camera_sd_status.atk_1bit_buffer_nonzero_count512 = nonzero_count;
    s_camera_sd_status.atk_1bit_buffer_zero_count512 = zero_count;
    s_camera_sd_status.atk_1bit_buffer_ff_count512 = ff_count;
    s_camera_sd_status.atk_1bit_buffer_prefill_count512 = prefill_count;
    s_camera_sd_status.atk_1bit_buffer_changed_count512 = changed_count;
    s_camera_sd_status.atk_1bit_buffer_changed =
        (changed_count > 0U) ? 1U : 0U;
    s_camera_sd_status.atk_1bit_buffer_all_prefill =
        (prefill_count == length) ? 1U : 0U;
    s_camera_sd_status.atk_1bit_buffer_all_zero =
        (zero_count == length) ? 1U : 0U;
    s_camera_sd_status.atk_1bit_buffer_all_ff =
        (ff_count == length) ? 1U : 0U;
    s_camera_sd_status.atk_1bit_buffer_first_changed_index =
        first_changed_index;
    s_camera_sd_status.atk_1bit_buffer_last_changed_index =
        last_changed_index;
    memcpy(s_camera_sd_status.atk_1bit_buffer_first16, buffer,
           sizeof(s_camera_sd_status.atk_1bit_buffer_first16));
    memcpy(s_camera_sd_status.atk_1bit_buffer_first32, buffer,
           sizeof(s_camera_sd_status.atk_1bit_buffer_first32));
    memcpy(s_camera_sd_status.atk_1bit_buffer_tail16,
           &buffer[length - sizeof(s_camera_sd_status.atk_1bit_buffer_tail16)],
           sizeof(s_camera_sd_status.atk_1bit_buffer_tail16));
}

static uint32_t Camera_SDStorage_ApplyAtkOfficialSdioGpioConfig(void)
{
    GPIO_InitTypeDef gpio = {0};
    uint32_t index;

    ++s_camera_sd_status.atk_official_gpio_config_attempt_count;

    __HAL_RCC_GPIOC_CLK_ENABLE();
    __HAL_RCC_GPIOD_CLK_ENABLE();

    gpio.Pin = CAMERA_SD_FULL_GPIOC_PIN_MASK;
    gpio.Mode = GPIO_MODE_AF_PP;
    gpio.Pull = GPIO_PULLUP;
    gpio.Speed = GPIO_SPEED_FREQ_HIGH;
    gpio.Alternate = GPIO_AF12_SDIO;
    HAL_GPIO_Init(GPIOC, &gpio);

    gpio.Pin = CAMERA_SD_FULL_GPIOD_PIN_MASK;
    HAL_GPIO_Init(GPIOD, &gpio);

    for (index = 0U;
         index < (sizeof(s_camera_sd_lines) / sizeof(s_camera_sd_lines[0]));
         ++index)
    {
        const Camera_SDLineDef_t *line = &s_camera_sd_lines[index];

        if ((Camera_SDStorage_GetPinMode(line->port, line->pin_number) != 2U) ||
            (Camera_SDStorage_GetPinPull(line->port, line->pin_number) !=
             GPIO_PULLUP) ||
            (Camera_SDStorage_GetPinSpeed(line->port, line->pin_number) !=
             GPIO_SPEED_FREQ_HIGH) ||
            (Camera_SDStorage_GetPinAf(line->port, line->pin_number) != 12U))
        {
            return CAMERA_SD_ERR_SDIO_FULL_GPIO_SWITCH_FAILED;
        }
    }

    ++s_camera_sd_status.atk_official_gpio_config_success_count;
    return CAMERA_SD_OK;
}

static void Camera_SDStorage_PrepareSdHandle(void)
{
    hsd_snapshot.Instance = SDIO;
    hsd_snapshot.Init.ClockEdge = SDIO_CLOCK_EDGE_RISING;
    hsd_snapshot.Init.ClockBypass = SDIO_CLOCK_BYPASS_DISABLE;
    hsd_snapshot.Init.ClockPowerSave = SDIO_CLOCK_POWER_SAVE_DISABLE;
    /* Stage 11C-4 保持 1-bit 初始化，不切换 4-bit，也不配置宽总线。 */
    hsd_snapshot.Init.BusWide = SDIO_BUS_WIDE_1B;
    hsd_snapshot.Init.HardwareFlowControl =
        SDIO_HARDWARE_FLOW_CONTROL_DISABLE;
    /* 编译期固定分频用于 C5J 单固件、单参数的 SDIO 采样稳定性对照。 */
    hsd_snapshot.Init.ClockDiv = CAMERA_SD_INIT_CLOCK_DIV;
    /* Stage 11C-4 读取 HAL 层卡信息，不接 FATFS，不执行块读写。 */
}

static void Camera_SDStorage_PrepareAtkOfficialSdHandle(void)
{
    hsd_snapshot.Instance = SDIO;
    hsd_snapshot.Init.ClockEdge = SDIO_CLOCK_EDGE_RISING;
    hsd_snapshot.Init.ClockBypass = SDIO_CLOCK_BYPASS_DISABLE;
    hsd_snapshot.Init.ClockPowerSave = SDIO_CLOCK_POWER_SAVE_DISABLE;
    hsd_snapshot.Init.BusWide = SDIO_BUS_WIDE_1B;
    hsd_snapshot.Init.HardwareFlowControl =
        SDIO_HARDWARE_FLOW_CONTROL_DISABLE;
    hsd_snapshot.Init.ClockDiv = 1U;
}

