IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_sd_storage.c
    start_ms = HAL_GetTick();
    hal_status = HAL_SD_ReadBlocks(
        &hsd_snapshot,
        read_buffer,
        block_addr,
        1U,
        1000U);
    Camera_SDStorage_CaptureSdioRegSnapshot(&s_read_reg_diag.after_read);
    s_read_reg_diag.last_hal_state_after_read =
        (uint32_t)hsd_snapshot.State;
    s_read_reg_diag.last_hal_error_after_read =
        HAL_SD_GetError(&hsd_snapshot);
    Camera_SDStorage_AnalyzeReadBuffer(
        (const uint8_t *)read_buffer,
        CAMERA_SD_READ_BUFFER_LEN);
    s_camera_sd_status.last_block_read_operation_ms =
        HAL_GetTick() - start_ms;
    s_camera_sd_status.last_block_read_status = (uint32_t)hal_status;
    s_camera_sd_status.last_block_read_error =
        s_read_reg_diag.last_hal_error_after_read;
    s_camera_sd_status.last_block_read_error_is_data_crc_fail =
        ((s_camera_sd_status.last_block_read_error &
          HAL_SD_ERROR_DATA_CRC_FAIL) != 0U) ? 1U : 0U;
    s_camera_sd_status.last_block_read_error_is_cmd_crc_fail =
        ((s_camera_sd_status.last_block_read_error &
          HAL_SD_ERROR_CMD_CRC_FAIL) != 0U) ? 1U : 0U;
    s_camera_sd_status.last_block_read_error_is_cmd_rsp_timeout =
        ((s_camera_sd_status.last_block_read_error &
          HAL_SD_ERROR_CMD_RSP_TIMEOUT) != 0U) ? 1U : 0U;
    s_camera_sd_status.last_block_read_error_is_data_timeout =
        ((s_camera_sd_status.last_block_read_error &
          HAL_SD_ERROR_DATA_TIMEOUT) != 0U) ? 1U : 0U;
    s_camera_sd_status.last_block_read_error_is_rx_overrun =
        ((s_camera_sd_status.last_block_read_error &
          HAL_SD_ERROR_RX_OVERRUN) != 0U) ? 1U : 0U;
    s_camera_sd_status.last_block_read_error_is_tx_underrun =
        ((s_camera_sd_status.last_block_read_error &
          HAL_SD_ERROR_TX_UNDERRUN) != 0U) ? 1U : 0U;
    s_camera_sd_status.last_hal_sd_state =
        (uint32_t)HAL_SD_GetState(&hsd_snapshot);
    s_camera_sd_status.last_block_read_post_card_state =
        (uint32_t)HAL_SD_GetCardState(&hsd_snapshot);
    s_camera_sd_status.last_hal_sd_card_state =
        s_camera_sd_status.last_block_read_post_card_state;

    if (hal_status != HAL_OK)
    {
        ++s_camera_sd_status.block_read_error_count;
        s_camera_sd_status.last_block_read_size = 0U;
        s_camera_sd_status.last_block_read_sum = 0U;
        s_camera_sd_status.last_block_read_xor = 0U;
        s_camera_sd_status.last_block_read_nonzero_count = 0U;
        memset(
            s_camera_sd_status.last_block_read_first16,
            0,
            sizeof(s_camera_sd_status.last_block_read_first16));
        s_camera_sd_status.last_error_code =
            CAMERA_SD_ERR_BLOCK_READ_FAILED;
        return CAMERA_SD_ERR_BLOCK_READ_FAILED;
    }

    for (index = 0U; index < sizeof(s_sd_read_test_words); ++index)
    {
        uint32_t value = read_buffer[index];

        sum += value;
        xor_value ^= value;
        if (value != 0U)
        {
            ++nonzero_count;
        }
    }

    ++s_camera_sd_status.block_read_success_count;
    s_camera_sd_status.last_block_read_size =
        (uint32_t)sizeof(s_sd_read_test_words);
    s_camera_sd_status.last_block_read_sum = sum;
    s_camera_sd_status.last_block_read_xor = xor_value;
    s_camera_sd_status.last_block_read_nonzero_count = nonzero_count;
    memcpy(
        s_camera_sd_status.last_block_read_first16,
        read_buffer,
        sizeof(s_camera_sd_status.last_block_read_first16));
    s_camera_sd_status.last_error_code = CAMERA_SD_OK;
    return CAMERA_SD_OK;
}

static uint32_t Camera_SDStorage_ReleaseConflictPins(void)
{
    uint32_t start_ms = HAL_GetTick();
    GPIO_InitTypeDef gpio = {0};

    ++s_camera_sd_status.conflict_pin_release_attempt_count;

    /* 只释放 PC8、PC9、PC11；不配置 PC10、PC12、PD2 或任何 SDIO 复用。 */
    gpio.Pin = CAMERA_SD_CONFLICT_PIN_MASK;
    gpio.Mode = GPIO_MODE_INPUT;
    gpio.Pull = GPIO_NOPULL;
    gpio.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOC, &gpio);

    if (((GPIOC->MODER & CAMERA_SD_CONFLICT_MODE_MASK) != 0U) ||
        ((GPIOC->PUPDR & CAMERA_SD_CONFLICT_MODE_MASK) != 0U))
    {
        ++s_camera_sd_status.conflict_pin_release_error_count;
        s_camera_sd_status.conflict_pins_released = 0U;
        s_camera_sd_status.last_conflict_pin_error_code =
            CAMERA_SD_ERR_CONFLICT_PIN_RELEASE_FAILED;
        s_camera_sd_status.last_conflict_pin_operation_ms =
            HAL_GetTick() - start_ms;
        return CAMERA_SD_ERR_CONFLICT_PIN_RELEASE_FAILED;
    }

    ++s_camera_sd_status.conflict_pin_release_success_count;
    s_camera_sd_status.conflict_pins_released = 1U;
    s_camera_sd_status.last_conflict_pin_error_code = CAMERA_SD_OK;
    s_camera_sd_status.last_conflict_pin_operation_ms =
        HAL_GetTick() - start_ms;
    return CAMERA_SD_OK;
}

static uint32_t Camera_SDStorage_SwitchConflictPinsToSdioAf12(void)
{
    uint32_t start_ms = HAL_GetTick();
    GPIO_InitTypeDef gpio = {0};

    ++s_camera_sd_status.sdio_af12_switch_attempt_count;

    /* 只将 PC8、PC9、PC11 切换为 SDIO AF12，不处理 PC10、PC12、PD2。 */
    gpio.Pin = CAMERA_SD_CONFLICT_PIN_MASK;
    gpio.Mode = GPIO_MODE_AF_PP;
    gpio.Pull = GPIO_PULLUP;
    gpio.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    gpio.Alternate = GPIO_AF12_SDIO;
    HAL_GPIO_Init(GPIOC, &gpio);

    /* 进入复用态后已不再是 GPIO 输入释放态。 */
    s_camera_sd_status.conflict_pins_released = 0U;

    if (((GPIOC->MODER & CAMERA_SD_CONFLICT_MODE_MASK) !=
         CAMERA_SD_CONFLICT_AF_MODE) ||
        ((GPIOC->PUPDR & CAMERA_SD_CONFLICT_MODE_MASK) !=
         CAMERA_SD_CONFLICT_PULLUP) ||
        ((GPIOC->OSPEEDR & CAMERA_SD_CONFLICT_MODE_MASK) !=
         CAMERA_SD_CONFLICT_SPEED_VERY_HIGH) ||
        ((GPIOC->OTYPER & CAMERA_SD_CONFLICT_PIN_MASK) != 0U) ||
        ((GPIOC->AFR[1] & CAMERA_SD_CONFLICT_AFRH_MASK) !=
         CAMERA_SD_CONFLICT_AFRH_AF12))
    {
        ++s_camera_sd_status.sdio_af12_switch_error_count;
        s_camera_sd_status.sdio_af12_selected = 0U;
        s_camera_sd_status.last_sdio_af12_error_code =
            CAMERA_SD_ERR_SDIO_AF12_SWITCH_FAILED;
        s_camera_sd_status.last_sdio_af12_operation_ms =
            HAL_GetTick() - start_ms;
        return CAMERA_SD_ERR_SDIO_AF12_SWITCH_FAILED;
    }

    ++s_camera_sd_status.sdio_af12_switch_success_count;
    s_camera_sd_status.sdio_af12_selected = 1U;
    s_camera_sd_status.last_sdio_af12_error_code = CAMERA_SD_OK;
    s_camera_sd_status.last_sdio_af12_operation_ms =
        HAL_GetTick() - start_ms;
    return CAMERA_SD_OK;
}

static uint32_t Camera_SDStorage_LeaveSdioAf12ToInput(void)
{
    uint32_t start_ms = HAL_GetTick();
    GPIO_InitTypeDef gpio = {0};

    ++s_camera_sd_status.sdio_af12_restore_attempt_count;

    /* 只将 PC8、PC9、PC11 从 SDIO AF12 退回无上下拉的 GPIO 输入态。 */
    gpio.Pin = CAMERA_SD_CONFLICT_PIN_MASK;
    gpio.Mode = GPIO_MODE_INPUT;
    gpio.Pull = GPIO_NOPULL;
    gpio.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOC, &gpio);

    if (((GPIOC->MODER & CAMERA_SD_CONFLICT_MODE_MASK) != 0U) ||
        ((GPIOC->PUPDR & CAMERA_SD_CONFLICT_MODE_MASK) != 0U))
    {
        ++s_camera_sd_status.sdio_af12_restore_error_count;
        s_camera_sd_status.sdio_af12_selected = 0U;
        s_camera_sd_status.conflict_pins_released = 0U;
        s_camera_sd_status.last_sdio_af12_error_code =
            CAMERA_SD_ERR_SDIO_AF12_RESTORE_FAILED;
        s_camera_sd_status.last_sdio_af12_operation_ms =
            HAL_GetTick() - start_ms;
        return CAMERA_SD_ERR_SDIO_AF12_RESTORE_FAILED;
    }

    ++s_camera_sd_status.sdio_af12_restore_success_count;
    s_camera_sd_status.sdio_af12_selected = 0U;
    s_camera_sd_status.conflict_pins_released = 1U;
    s_camera_sd_status.last_sdio_af12_error_code = CAMERA_SD_OK;
    s_camera_sd_status.last_sdio_af12_operation_ms =
        HAL_GetTick() - start_ms;
    return CAMERA_SD_OK;
}

static uint32_t Camera_SDStorage_SwitchFullSdioGpioToAf12(void)
{
    uint32_t start_ms = HAL_GetTick();
    GPIO_InitTypeDef gpio = {0};

    ++s_camera_sd_status.sdio_full_gpio_switch_attempt_count;

    /* 配置 PC8、PC9、PC10、PC11、PC12 为完整 SDIO GPIO 的 AF12。 */
    gpio.Pin = CAMERA_SD_FULL_GPIOC_PIN_MASK;
    gpio.Mode = GPIO_MODE_AF_PP;
    gpio.Pull = GPIO_PULLUP;
    gpio.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    gpio.Alternate = GPIO_AF12_SDIO;
    HAL_GPIO_Init(GPIOC, &gpio);

    /* 配置 PD2 为 SDIO_CMD 的 AF12，不访问 SDIO 外设。 */
    gpio.Pin = CAMERA_SD_FULL_GPIOD_PIN_MASK;
    HAL_GPIO_Init(GPIOD, &gpio);

    if (((GPIOC->MODER & CAMERA_SD_FULL_GPIOC_MODE_MASK) !=
         CAMERA_SD_FULL_GPIOC_AF_MODE) ||
        ((GPIOC->PUPDR & CAMERA_SD_FULL_GPIOC_MODE_MASK) !=
         CAMERA_SD_FULL_GPIOC_PULLUP) ||
        ((GPIOC->OSPEEDR & CAMERA_SD_FULL_GPIOC_MODE_MASK) !=
         CAMERA_SD_FULL_GPIOC_MODE_MASK) ||
        ((GPIOC->OTYPER & CAMERA_SD_FULL_GPIOC_PIN_MASK) != 0U) ||
        ((GPIOC->AFR[1] & CAMERA_SD_FULL_GPIOC_AFRH_MASK) !=
         CAMERA_SD_FULL_GPIOC_AFRH_AF12) ||
        ((GPIOD->MODER & CAMERA_SD_FULL_GPIOD_MODE_MASK) !=
         CAMERA_SD_FULL_GPIOD_AF_MODE) ||
        ((GPIOD->PUPDR & CAMERA_SD_FULL_GPIOD_MODE_MASK) !=
         CAMERA_SD_FULL_GPIOD_PULLUP) ||
        ((GPIOD->OSPEEDR & CAMERA_SD_FULL_GPIOD_MODE_MASK) !=
         CAMERA_SD_FULL_GPIOD_MODE_MASK) ||
        ((GPIOD->OTYPER & CAMERA_SD_FULL_GPIOD_PIN_MASK) != 0U) ||
        ((GPIOD->AFR[0] & CAMERA_SD_FULL_GPIOD_AFRL_MASK) !=
         CAMERA_SD_FULL_GPIOD_AFRL_AF12))
    {
        ++s_camera_sd_status.sdio_full_gpio_switch_error_count;
        s_camera_sd_status.sdio_full_gpio_af12_selected = 0U;
        s_camera_sd_status.last_sdio_full_gpio_error_code =
            CAMERA_SD_ERR_SDIO_FULL_GPIO_SWITCH_FAILED;
        s_camera_sd_status.last_sdio_full_gpio_operation_ms =
            HAL_GetTick() - start_ms;
        return CAMERA_SD_ERR_SDIO_FULL_GPIO_SWITCH_FAILED;
    }

    ++s_camera_sd_status.sdio_full_gpio_switch_success_count;
    s_camera_sd_status.sdio_full_gpio_af12_selected = 1U;
    s_camera_sd_status.last_sdio_full_gpio_error_code = CAMERA_SD_OK;
    s_camera_sd_status.last_sdio_full_gpio_operation_ms =
        HAL_GetTick() - start_ms;
    return CAMERA_SD_OK;
}

static uint32_t Camera_SDStorage_LeaveFullSdioGpioToInput(void)
{
    uint32_t start_ms = HAL_GetTick();
    GPIO_InitTypeDef gpio = {0};

