IPSNewbie/STM32F429_OV5640_FreeRTOS/BSPDrivers/Src/camera_sd_storage.c
    if (Camera_SnapshotControl_IsTakeoverPreconditionReady() == 0U)
    {
        ++s_camera_sd_status.atk_1bit_init_error_count;
        s_camera_sd_status.atk_1bit_init_ready = 0U;
        s_camera_sd_status.atk_1bit_last_operation_ms =
            HAL_GetTick() - start_ms;
        return CAMERA_SD_ERR_SNAPSHOT_NOT_PAUSED;
    }

    if (s_camera_sd_status.sdio_full_gpio_af12_selected != 1U)
    {
        ++s_camera_sd_status.atk_1bit_init_error_count;
        s_camera_sd_status.atk_1bit_init_ready = 0U;
        s_camera_sd_status.atk_1bit_last_operation_ms =
            HAL_GetTick() - start_ms;
        return CAMERA_SD_ERR_NEED_TAKEOVER;
    }

    Camera_SDStorage_ResetAtk1BitAttemptStatus();
    ++s_camera_sd_status.atk_1bit_gpio_config_attempt_count;
    result = Camera_SDStorage_ApplyAtkOfficialSdioGpioConfig();
    if (result != CAMERA_SD_OK)
    {
        ++s_camera_sd_status.atk_1bit_init_error_count;
        s_camera_sd_status.atk_1bit_last_operation_ms =
            HAL_GetTick() - start_ms;
        return result;
    }
    ++s_camera_sd_status.atk_1bit_gpio_config_success_count;

    Camera_SDStorage_EnableSdioClock();
    s_atk_1bit_path_active = 1U;
    Camera_SDStorage_PrepareAtkOfficialSdHandle();

    hal_status = HAL_SD_Init(&hsd_snapshot);
    s_camera_sd_status.atk_1bit_hal_init_status = (uint32_t)hal_status;
    s_camera_sd_status.atk_1bit_hal_error =
        HAL_SD_GetError(&hsd_snapshot);
    if (hal_status != HAL_OK)
    {
        ++s_camera_sd_status.atk_1bit_init_error_count;
        s_camera_sd_status.atk_1bit_last_operation_ms =
            HAL_GetTick() - start_ms;
        return CAMERA_SD_ERR_SDIO_HAL_INIT_FAILED;
    }

    s_atk_1bit_hal_initialized = 1U;
    s_camera_sd_status.atk_1bit_bus_width = 1U;
    hal_status = HAL_SD_GetCardInfo(&hsd_snapshot, &card_info);
    s_camera_sd_status.atk_1bit_cardinfo_status = (uint32_t)hal_status;
    s_camera_sd_status.atk_1bit_cardinfo_error =
        HAL_SD_GetError(&hsd_snapshot);
    if (hal_status != HAL_OK)
    {
        ++s_camera_sd_status.atk_1bit_init_error_count;
        s_camera_sd_status.atk_1bit_last_operation_ms =
            HAL_GetTick() - start_ms;
        return CAMERA_SD_ERR_CARD_INFO_FAILED;
    }

    result = Camera_SDStorage_Atk1BitWaitCardTransfer(
        CAMERA_SD_ATK_WAIT_TRANSFER_TIMEOUT_MS);
    if (result != CAMERA_SD_OK)
    {
        ++s_camera_sd_status.atk_1bit_init_error_count;
        s_camera_sd_status.atk_1bit_last_operation_ms =
            HAL_GetTick() - start_ms;
        return result;
    }

    ++s_camera_sd_status.atk_1bit_init_success_count;
    s_camera_sd_status.atk_1bit_init_ready = 1U;
    s_camera_sd_status.atk_1bit_last_operation_ms =
        HAL_GetTick() - start_ms;
    return CAMERA_SD_OK;
}

uint32_t Camera_SDStorage_AtkOfficial1BitReadBlock(uint32_t block_addr)
{
    uint8_t *read_buffer = (uint8_t *)s_atk_1bit_read_buffer_words;
    uint32_t operation_start_ms;
    uint32_t wait_start_ms;
    uint32_t primask;
    uint32_t wait_poll_count = 0U;
    uint32_t wait_success = 0U;
    uint32_t hal_error;
    HAL_StatusTypeDef hal_status;
    HAL_SD_CardStateTypeDef card_state;

    if ((s_camera_sd_status.atk_1bit_init_ready != 1U) ||
        (s_atk_1bit_hal_initialized != 1U) ||
        (s_atk_1bit_path_active != 1U))
    {
        return CAMERA_SD_ERR_BLOCK_READ_NOT_READY;
    }

    memset(read_buffer, CAMERA_SD_READ_PREFILL_PATTERN,
           sizeof(s_atk_1bit_read_buffer_words));
    ++s_camera_sd_status.atk_1bit_read_attempt_count;
    s_camera_sd_status.atk_1bit_last_read_addr = block_addr;
    s_camera_sd_status.atk_1bit_last_read_count = 1U;
    s_camera_sd_status.atk_1bit_last_read_size = 0U;
    s_camera_sd_status.atk_1bit_read_wait_timeout_ms =
        CAMERA_SD_ATK_1BIT_READ_TIMEOUT_MS;
    s_camera_sd_status.atk_1bit_read_pre_card_state =
        (uint32_t)HAL_SD_GetCardState(&hsd_snapshot);

    operation_start_ms = HAL_GetTick();
    primask = __get_PRIMASK();
    __disable_irq();

    hal_status = HAL_SD_ReadBlocks(
        &hsd_snapshot,
        read_buffer,
        block_addr,
        1U,
        CAMERA_SD_ATK_1BIT_READ_TIMEOUT_MS);
    hal_error = HAL_SD_GetError(&hsd_snapshot);
    card_state = HAL_SD_GetCardState(&hsd_snapshot);
    s_camera_sd_status.atk_1bit_read_post_card_state =
        (uint32_t)card_state;
    wait_start_ms = HAL_GetTick();

    for (;;)
    {
        s_camera_sd_status.atk_1bit_read_wait_card_state =
            (uint32_t)card_state;
        if (card_state == HAL_SD_CARD_TRANSFER)
        {
            wait_success = 1U;
            break;
        }

        if (wait_poll_count >= CAMERA_SD_ATK_1BIT_WAIT_POLL_LIMIT)
        {
            break;
        }

        ++wait_poll_count;
        card_state = HAL_SD_GetCardState(&hsd_snapshot);
    }

    if (primask == 0U)
    {
        __enable_irq();
    }

    s_camera_sd_status.atk_1bit_last_read_operation_ms =
        HAL_GetTick() - operation_start_ms;
    s_camera_sd_status.atk_1bit_read_wait_operation_ms =
        HAL_GetTick() - wait_start_ms;
    s_camera_sd_status.atk_1bit_last_read_status = (uint32_t)hal_status;
    s_camera_sd_status.atk_1bit_last_read_error = hal_error;
    s_camera_sd_status.atk_1bit_read_error_is_data_crc_fail =
        ((hal_error & HAL_SD_ERROR_DATA_CRC_FAIL) != 0U) ? 1U : 0U;
    s_camera_sd_status.atk_1bit_read_error_is_cmd_crc_fail =
        ((hal_error & HAL_SD_ERROR_CMD_CRC_FAIL) != 0U) ? 1U : 0U;
    s_camera_sd_status.atk_1bit_read_error_is_cmd_rsp_timeout =
        ((hal_error & HAL_SD_ERROR_CMD_RSP_TIMEOUT) != 0U) ? 1U : 0U;
    s_camera_sd_status.atk_1bit_read_error_is_data_timeout =
        ((hal_error & HAL_SD_ERROR_DATA_TIMEOUT) != 0U) ? 1U : 0U;
    s_camera_sd_status.atk_1bit_read_error_is_rx_overrun =
        ((hal_error & HAL_SD_ERROR_RX_OVERRUN) != 0U) ? 1U : 0U;
    s_camera_sd_status.atk_1bit_read_error_is_tx_underrun =
        ((hal_error & HAL_SD_ERROR_TX_UNDERRUN) != 0U) ? 1U : 0U;
    Camera_SDStorage_AnalyzeAtk1BitReadBuffer(
        (const uint8_t *)read_buffer,
        CAMERA_SD_READ_BUFFER_LEN);

    if ((hal_status == HAL_OK) && (wait_success != 0U))
    {
        ++s_camera_sd_status.atk_1bit_read_success_count;
        s_camera_sd_status.atk_1bit_last_read_size =
            CAMERA_SD_READ_BUFFER_LEN;
        return CAMERA_SD_OK;
    }

    ++s_camera_sd_status.atk_1bit_read_error_count;
    if (hal_status != HAL_OK)
    {
        return CAMERA_SD_ERR_BLOCK_READ_FAILED;
    }

